# xorg, i3 and light
xorg-server 
xorg-xinit 
i3-wm 
i3blocks 
i3lock 
i3status 
light

# browser
firefox 
geckodriver 

# terminal 
alacritty 
fzf 

# utilities
dmenu
htop 
trash-cli 
man-db 
man-pages

# ssh and network
openssh 
sshpass
openvpn
networkmanager-openvpn
network-manager-applet

# latex
texlive-core 
texlive-fontsextra 
texlive-bibtexextra 
texstudio

# text editors and command line tools for text
neovim 
gvim 
pandoc 
pandoc-crossref

# documents viewers
okular 
mupdf 
calibre

# image viewers and image manipulation
feh 
inkscape 
gimp 
pngquant 
jpegoptim 
imagemagick

# audio and video tools
audacity 
cheese 
ffmpeg
vlc

# finance
gnucash

# audio meta data
kid3

# rlone and dropbox dependencies
rclone
python-gpgme

# misc command line tools
xdotool 
gprename 
pdfgrep 
xclip 
source-highlight

# python 2
python2

# c++ libraries
boost

# R and package dependencies
r
tk
tcl
jdk-openjdk
gcc-fortran

# android packages
libmtp
heimdall
android-tools

# icon themes
lxappearance
breeze

# fonts
ttf-ubuntu-font-family 
gnu-free-fonts 
noto-fonts 
ttf-dejavu
ttf-liberation

