# xorg, i3 and associated utilities
xorg-server 
xorg-xinit 
i3-wm 
i3blocks 
i3status 
redshift
wmctrl
xorg-xkill
dmenu
picom

# wayland, sway and associated utilities
sway
swaybg
xorg-xwayland
light
gammastep
wl-clipboard 
qt6-wayland

# browser
firefox 
geckodriver 
lynx
newsboat

# file browser
dolphin

# terminal 
alacritty 
fzf 
ripgrep
exa

# utilities
htop 
trash-cli 
man-db 
man-pages
wget
pacman-contrib
unrar
aspell
aspell-en
tree
gnuplot
wdiff
perl-image-exiftool

# computation
openblas

# linode
s3cmd
certbot

# audio
alsa-utils
pulseaudio
pavucontrol

# ssh and network
openssh 
sshpass
openvpn
networkmanager-openvpn
network-manager-applet
tailscale
rtorrent

# latex
texlive-core 
texlive-fontsextra 
texlive-bibtexextra 
texlive-latexextra
texstudio


# text editors and command line tools for text
neovim 
pandoc-crossref
docx2txt

# office suites
libreoffice-fresh


# documents viewers
okular 
evince
calibre
zathura
zathura-pdf-mupdf

# image viewers and image manipulation
feh 
inkscape 
gimp 
pngquant 
jpegoptim 
imagemagick
imv

# audio and video tools
audacity 
cheese 
ffmpeg
vlc

# finance
gnucash

# audio meta data
kid3

# syncing utilities
rclone
python-gpgme
rsync

# misc command line tools
xdotool 
gprename 
pdfgrep 
xclip 
source-highlight

# python 
python-opencv
python-pip

# c++ libraries
boost

# R and package dependencies
r
tk
tcl
jdk-openjdk
gcc-fortran
gdal

# android packages
libmtp
heimdall
android-tools

# icon themes
lxappearance
breeze

# fonts
ttf-ubuntu-font-family 
gnu-free-fonts 
noto-fonts 
ttf-dejavu
ttf-liberation
ttf-font-awesome
ttf-bitstream-vera
ttf-croscore
ttf-droid
ttf-roboto

# screenshot
grim
slurp

# cd
k3b
cdrtools
cdrdao
dvd+rw-tools

# hugo
hugo
nodejs
npm

# wine
wine
winetricks

# blair laptop
# --------------------------
acpi
bluez
bluez-utils
pulseaudio-bluetooth
cpupower
tlp

# blair server
# --------------------------
cups
syncthing


